---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Sketch
source: html/37c14678-6dd1-0e61-8861-fd5fc3698817.htm
---
# Sketch Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.